physical-design = 物理设计
physical-design-description = 物理设计集成于研究系统中的物理实体，及它们之间如何相互关联。逻辑设计只研究体系结构（架构）问题，物理设计研究组织问题。
component-description = 一个组件就是物理设计的最小单位。一个组件包含一组逻辑设计的子集，该子集可以作为一个独立的、内聚的单位存在。
package-description = 一个包就是被组织成一个物理内聚单位的组件集合。
knowledge-transform = 知识转换成本依赖于项目复杂度（代码量、上手难度）、组织成员的变更数。
learning-curve-desc = 项目的上手复杂度与开发人员的提交量成正比，即复杂的项目上手成本越高，短期的提交量越少。Coco 是根据最近 30 周的提交次数/代码修改行数，绘制出来的曲线。（适用于以团队为单位的软件开发）。
members-lifecycle-desc = 软件团队的规模呈线性增长时，沟通成本介于线性增长和指数级增长之间。而离职人员数越多时，则会因为新成员不了解系统的设计，就可能增加出错的可能性。
metrics-purpose = 1. 帮助跟踪和理解发生了什么。 2. 帮助人们沟通发生的事情。 3. 帮助人们关注那些他们真正需要改善的事情。
